#基本構文
#配列名（変数名） = [要素1, 要素2, 要素3...]
#- 配列名は複数形が望ましい（`user`の配列を定義する場合は`users`）
#- オブジェクトごとにカンマ（`,`）区切る

animals = ["犬", "猫", "猿"]
puts animals #犬 猫 猿
puts "-----------------------------------"
puts animals[0] #犬
puts animals[2] #猿
puts "-----------------------------------"
#要素更新の基本構文
# 配列名[インデックス] = 更新したいオブジェクト   *インデックスは0から
animals[1] = "キリン"
puts animals #犬 キリン 猿
puts "-----------------------------------"
#pushメソッドを使った要素追加の基本構文
#配列名.push(追加する要素)
animals.push("ライオン")
puts animals #犬 キリン 猿 ライオン
puts "-----------------------------------"
#delete_atを使った要素削除の基本構文
# 配列名.delete_at(削除する要素のインデックス)
animals.delete_at(0)
puts animals #キリン 猿 ライオン
